app/controllers/students_controller.rb

    def create
        student=Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Cooper"], ["last_name", "Neyer "], ["created_at", "2020-06-06 16:40:39.910730"], ["updated_at", "2020-06-06 16:40:39.910730"]]

    def show
       if  Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        student=Student.find(params[:id])
        student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Cooper \"Good Boy\""], ["updated_at", "2020-06-06 16:47:05.619174"], ["id", 10]]